# tasks.py
TASKS = [
    "День 1: Определи 10 целей.", "День 2: Утренний ритуал.", "День 3: Откажись от привычки.",
    "День 4: Веди дневник.", "День 5: 10 сильных сторон.", "День 6: Детокс 6 часов.",
    "День 7: Итоги недели.", "День 8: Правило 20/80.", "День 9: 3 приоритета.",
    "День 10: Pomodoro.", "День 11: Порядок.", "День 12: Убери отвлечения.",
    "День 13: 2 часа работы.", "День 14: Оцени продуктивность.", "День 15: Миссия.",
    "День 16: Мини-выступления.", "День 17: Скажи 'нет'.", "День 18: Биография.",
    "День 19: Доброе дело.", "День 20: Визуализация.", "День 21: Оцени уверенность.",
    "День 22: План учёбы.", "День 23: Наставник.", "День 24: Анализ.", "День 25: Финансы.",
    "День 26: Окружение.", "День 27: Поделись.", "День 28: План месяца.", "День 29: Мечты.",
    "День 30: Карта жизни."
]

ACHIEVEMENTS = {5: "🏅 5 дней!", 10: "🥈 10 дней!", 20: "🥇 20 дней!", 30: "👑 30 дней!"}